Hybrid-Memcached/ex4_result/memtier_1t_16t_default_datasize_114_cycle_50_result
16        Threads
50        Connections per thread
120       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        25209.18          ---          ---        30.80020        30.71900        50.68700        61.43900      3840.46 
Gets           21.34        21.34         0.00        31.56604        31.10300        48.89500        59.64700         3.69 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      25230.52        21.34         0.00        30.80085        30.71900        50.68700        61.43900      3844.15 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.655        0.000
SET      23.039        5.000
SET      28.159       10.000
SET      29.183       15.000
SET      29.439       20.000
SET      29.695       25.000
SET      29.951       30.000
SET      30.079       35.000
SET      30.335       40.000
SET      30.463       45.000
SET      30.719       50.000
SET      30.847       52.500
SET      30.975       55.000
SET      31.103       57.500
SET      31.231       60.000
SET      31.359       62.500
SET      31.487       65.000
SET      31.615       67.500
SET      31.743       70.000
SET      31.871       72.500
SET      31.999       75.000
SET      31.999       76.250
SET      32.127       77.500
SET      32.127       78.750
SET      32.255       80.000
SET      32.255       81.250
SET      32.383       82.500
SET      32.511       83.750
SET      32.639       85.000
SET      32.767       86.250
SET      33.023       87.500
SET      33.023       88.125
SET      33.279       88.750
SET      33.279       89.375
SET      33.535       90.000
SET      33.791       90.625
SET      33.791       91.250
SET      34.303       91.875
SET      34.815       92.500
SET      35.583       93.125
SET      36.607       93.750
SET      37.119       94.062
SET      37.631       94.375
SET      38.399       94.688
SET      38.911       95.000
SET      39.935       95.312
SET      40.703       95.625
SET      41.471       95.938
SET      42.239       96.250
SET      43.263       96.562
SET      43.775       96.875
SET      44.287       97.031
SET      44.543       97.188
SET      44.799       97.344
SET      45.055       97.500
SET      45.567       97.656
SET      46.079       97.812
SET      46.591       97.969
SET      47.103       98.125
SET      47.615       98.281
SET      48.127       98.438
SET      48.383       98.516
SET      48.639       98.594
SET      49.151       98.672
SET      49.407       98.750
SET      49.663       98.828
SET      50.175       98.906
SET      50.687       98.984
SET      50.943       99.062
SET      51.199       99.141
SET      51.455       99.219
SET      51.455       99.258
SET      51.455       99.297
SET      51.711       99.336
SET      51.711       99.375
SET      51.711       99.414
SET      51.967       99.453
SET      51.967       99.492
SET      52.223       99.531
SET      52.479       99.570
SET      52.991       99.609
SET      52.991       99.629
SET      53.247       99.648
SET      53.503       99.668
SET      53.759       99.688
SET      54.015       99.707
SET      54.271       99.727
SET      54.783       99.746
SET      55.039       99.766
SET      55.551       99.785
SET      56.319       99.805
SET      56.575       99.814
SET      56.831       99.824
SET      57.087       99.834
SET      57.599       99.844
SET      58.111       99.854
SET      58.879       99.863
SET      59.391       99.873
SET      60.159       99.883
SET      60.927       99.893
SET      61.695       99.902
SET      62.463       99.907
SET      63.231       99.912
SET      64.255       99.917
SET      65.279       99.922
SET      67.071       99.927
SET      69.119       99.932
SET      71.167       99.937
SET      72.703       99.941
SET      74.751       99.946
SET      77.311       99.951
SET      78.335       99.954
SET      79.871       99.956
SET      81.407       99.958
SET      82.431       99.961
SET      84.991       99.963
SET      86.527       99.966
SET      88.063       99.968
SET      89.087       99.971
SET      90.623       99.973
SET      91.647       99.976
SET      92.671       99.977
SET      93.183       99.978
SET      93.695       99.979
SET      94.719       99.980
SET      96.255       99.982
SET      97.279       99.983
SET      98.815       99.984
SET     100.351       99.985
SET     101.887       99.987
SET     102.911       99.988
SET     103.423       99.988
SET     104.447       99.989
SET     105.471       99.990
SET     107.007       99.990
SET     108.543       99.991
SET     109.567       99.991
SET     111.103       99.992
SET     112.127       99.993
SET     114.175       99.993
SET     115.711       99.994
SET     116.735       99.994
SET     118.783       99.995
SET     119.295       99.995
SET     120.319       99.995
SET     121.343       99.995
SET     121.855       99.996
SET     121.855       99.996
SET     123.391       99.996
SET     124.415       99.997
SET     125.439       99.997
SET     125.951       99.997
SET     126.463       99.997
SET     128.511       99.997
SET     131.071       99.998
SET     290.815       99.998
SET     342.015       99.998
SET     385.023       99.998
SET     440.319       99.998
SET     493.567       99.998
SET     536.575       99.998
SET     565.247       99.999
SET     589.823       99.999
SET     610.303       99.999
SET     647.167       99.999
SET     671.743       99.999
SET     696.319       99.999
SET     716.799       99.999
SET     753.663       99.999
SET     778.239       99.999
SET     802.815       99.999
SET     827.391       99.999
SET     839.679       99.999
SET     851.967       99.999
SET     864.255       99.999
SET     872.447       99.999
SET     884.735       99.999
SET     897.023      100.000
SET     921.599      100.000
SET     933.887      100.000
SET     946.175      100.000
SET     958.463      100.000
SET     958.463      100.000
SET     970.751      100.000
SET     970.751      100.000
SET     983.039      100.000
SET     983.039      100.000
SET     991.231      100.000
SET    1003.519      100.000
SET    1003.519      100.000
SET    1015.807      100.000
SET    1015.807      100.000
SET    1015.807      100.000
SET    1019.903      100.000
SET    1019.903      100.000
SET    1019.903      100.000
[...]
SET    1023.999      100.000
SET    1023.999      100.000
SET    1023.999      100.000
[...]
SET    1032.191      100.000
SET    1032.191      100.000
SET    1032.191      100.000
[...]
SET    1044.479      100.000
SET    1044.479      100.000
---
GET      16.767        0.000
GET      28.415        5.000
GET      29.055       10.000
GET      29.439       15.000
GET      29.695       20.000
GET      29.951       25.000
GET      30.207       30.000
GET      30.463       35.000
GET      30.591       40.000
GET      30.847       45.000
GET      31.103       50.000
GET      31.103       52.500
GET      31.231       55.000
GET      31.359       57.500
GET      31.359       60.000
GET      31.487       62.500
GET      31.615       65.000
GET      31.615       67.500
GET      31.743       70.000
GET      31.743       72.500
GET      31.871       75.000
GET      31.999       76.250
GET      31.999       77.500
GET      32.127       78.750
GET      32.127       80.000
GET      32.255       81.250
GET      32.255       82.500
GET      32.383       83.750
GET      32.511       85.000
GET      32.639       86.250
GET      32.767       87.500
GET      32.767       88.125
GET      33.023       88.750
GET      33.023       89.375
GET      33.279       90.000
GET      33.279       90.625
GET      33.535       91.250
GET      34.303       91.875
GET      35.071       92.500
GET      35.583       93.125
GET      36.607       93.750
GET      37.119       94.062
GET      37.375       94.375
GET      38.143       94.688
GET      38.911       95.000
GET      39.167       95.312
GET      39.679       95.625
GET      41.471       95.938
GET      43.007       96.250
GET      44.031       96.562
GET      44.543       96.875
GET      45.055       97.031
GET      45.823       97.188
GET      45.823       97.344
GET      46.335       97.500
GET      46.335       97.656
GET      46.847       97.812
GET      47.103       97.969
GET      47.359       98.125
GET      47.615       98.281
GET      47.615       98.438
GET      47.871       98.516
GET      47.871       98.594
GET      47.871       98.672
GET      48.127       98.750
GET      48.127       98.828
GET      48.639       98.906
GET      48.895       98.984
GET      49.151       99.062
GET      50.431       99.141
GET      51.455       99.219
GET      51.711       99.258
GET      51.711       99.297
GET      51.711       99.336
GET      51.967       99.375
GET      51.967       99.414
GET      52.479       99.453
GET      53.503       99.492
GET      53.759       99.531
GET      54.271       99.570
GET      54.271       99.609
GET      55.295       99.629
GET      55.295       99.648
GET      55.295       99.668
GET      55.295       99.688
GET      55.295       99.707
GET      55.295       99.727
GET      55.295       99.746
GET      55.295       99.766
GET      55.551       99.785
GET      55.551       99.805
GET      59.135       99.814
GET      59.135       99.824
GET      59.135       99.834
GET      59.135       99.844
GET      59.647       99.854
GET      59.647       99.863
GET      59.647       99.873
GET      59.647       99.883
GET      62.463       99.893
GET      62.463       99.902
GET      62.463       99.907
GET      62.463       99.912
GET      62.463       99.917
GET      62.463       99.922
GET      62.463       99.927
GET      62.463       99.932
GET      62.463       99.937
GET      62.463       99.941
GET      62.463       99.946
GET      62.463       99.951
GET      62.463       99.954
GET      62.463       99.956
GET      62.463       99.958
GET      62.463       99.961
GET     124.927       99.963
GET     124.927      100.000
---
WAIT      0.000      100.000